app/views/samples/index.html.erb

  <table class="table">
  <%= pie_chart @samples.group(:race).count ,title: "Samples by Race"%>
  <%= pie_chart @samples.group(:gender).count ,title: "Samples by Gender"%>
  <%= pie_chart @samples.group(:ajcc_pathologic_tumor_stage).count ,title:"Samples by Stage"%>
---
SELECT "samples".* FROM "samples"
SELECT COUNT(*) AS count_all, race AS race FROM "samples" GROUP BY "samples"."race"
SELECT COUNT(*) AS count_all, gender AS gender FROM "samples" GROUP BY "samples"."gender"
SELECT COUNT(*) AS count_all, ajcc_pathologic_tumor_stage AS ajcc_pathologic_tumor_stage FROM "samples" GROUP BY "samples"."ajcc_pathologic_tumor_stage"